DataProcessors/ОбщиеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбщиеФормы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СписокТоваровДляВыбора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СписокТоваровДляВыбора</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОстатокСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСтрокиЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрихкодЕдИзмНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрихкодЕдИзмКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаАВСФилиала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмеренияСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ОбщиеФормы/Forms/ФормаВыбораТовараДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыРаботы = ОбщегоНазначения.ПолучитьПараметрыРаботыСДокументомПТУ();	
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыРаботы);	
	Элементы.ТоварыДокумента.Обновить();
	
	ЭтаФорма.Шапка.Очистить();
	//СтрокаТЗ = Шапка.Добавить();
	//СтрокаТЗ.ОписаниеСтатусаДокумента = "Найдено несколько единиц ";
	ПолучитьЗаголовокСтатуса();//"Найдено несколько товаров";
	
	ОбщегоНазначенияКлиент.ЗаполнитьТабЗначОК(ЭтаФорма);		
	ОбновитьСлуженоеСообщениеПодвал();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСлуженоеСообщениеПодвал() Экспорт
	
	ЭтаФорма.Подвал.Очистить();	
	СтрокаТЗ = Подвал.Добавить();
	СтрокаТЗ.ФИОСотрудника = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	СтрокаТЗ.ОписаниеРежимаВводаКоличества = ОбщегоНазначенияКлиент.ПолучитьОтображениеОРежимеВводеКоличества();	
	
	ЭтаФорма.ПодвалСообщение.Очистить();	
	СтрокаТЗ = ПодвалСообщение.Добавить();	
	СтрокаТЗ.СообщениеДляПользователя = "Выберите товар:";
	Элементы.ПодвалСообщение.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьДляРазмещения(Команда)
	
	ТоварГУИД  = Элементы.ТоварыДокумента.ТекущиеДанные.Владелец;	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ТипСтрокиЗапроса", Элементы.ТоварыДокумента.ТекущиеДанные.ТипСтрокиЗапроса);
	СписокПараметров.Вставить("ТоварГУИД", ТоварГУИД);
	СписокПараметров.Вставить("Коэффициент", Элементы.ТоварыДокумента.ТекущиеДанные.Коэффициент);
	Закрыть( СписокПараметров );
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначения.ЗаписатьРегистрСведений("СписокТоваровДляВыбора", Параметры.НайденныеТовары);	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗаголовокСтатуса() 
	ЗапросКоличестваТоваров = Новый Запрос;
	ЗапросКоличестваТоваров.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокТоваровДляВыбора.Владелец КАК Владелец
	|ИЗ
	|	РегистрСведений.СписокТоваровДляВыбора КАК СписокТоваровДляВыбора
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокТоваровДляВыбора.Владелец"; 	
	ТЗ = ЗапросКоличестваТоваров.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		СтрокаТЗ = Шапка.Добавить();
		СтрокаТЗ.ОписаниеСтатусаДокумента = "Найдено несколько единиц ";
		СтрокаТЗ = Шапка.Добавить();
		СтрокаТЗ.ОписаниеСтатусаДокумента = "с разной кратностью";
	ИначеЕсли ТЗ.Количество() > 1 Тогда 
		СтрокаТЗ = Шапка.Добавить();
		СтрокаТЗ.ОписаниеСтатусаДокумента = "Сообщите о совпадении ";
		СтрокаТЗ = Шапка.Добавить();
		СтрокаТЗ.ОписаниеСтатусаДокумента = "штрихкодов у данных товаров ";
		СтрокаТЗ = Шапка.Добавить();
		СтрокаТЗ.ОписаниеСтатусаДокумента = "своему руководителю ";
	КонецЕсли;	
КонецПроцедуры
